[
   {
      "projectName":"Stock Tracker",
      "projectDescription":"Stock Tracker is an app that allows users to follow stocks, create watchlists, and view stock trends and data and news all in one convenient place. Users can view detailed stock data and trend graphs up to the past 5 years. The front end utilizes Redux for simple state management, react hooks and react functional components to simplify codebase and make it more robust. Stock Track has full CRUD operations, and user authentication using JWT with tokens.",
      "techStack":[
         "TypeScript",
         "React",
         "Redux",
         "Node",
         "SASS",
         "MongoDB"
      ],
      "links":[
         {
            "name":"GitHub Repo",
            "url":"https://github.com/doanja/Stock-Tracker-TS"
         },
         {
            "name":"Demo",
            "url":"https://doanja-stock-tracker-ts.herokuapp.com/"
         }
      ]
   },
   {
      "projectName":"Recipe Mate",
      "projectDescription":"Recipe Mate is a single page web app (SPA) that allows users to search and browse for recipes. Recipes are organized in an user friendly way that allow both desktop and mobile users to easily check off ingredients for various recipes, and follow step-by-step instructions without clutter. Recipe Mate has full CRUD operations, and user authentication using JWT with tokens.",
      "techStack":[
         "TypeScript",
         "React",
         "Redux",
         "Node",
         "SASS",
         "MongoDB"
      ],
      "links":[
         {
            "name":"GitHub Repo",
            "url":"https://github.com/doanja/Recipe-Mate"
         },
         {
            "name":"Demo",
            "url":"https://doanja-recipe-mate.herokuapp.com/"
         }
      ]
   },
   {
      "projectName":"Finance App",
      "projectDescription":"Finance is a web application that allows users to track their expenses and goals. Users can create categories and expenses. Categories can be assigned a goal amount. Expenses can be assigned an amount, date and assigned to a category. Ussr can view their expenses in a tabular view or bar charts. Using date filters, the user’s data can be summarized in a multitude of ways. Users can also easily mass import expenses from a CSV file.",
      "techStack":[
         "JavaScript",
         "jQuery",
         "Bootstrap",
         "MySQL",
         "Node"
      ],
      "links":[
         {
            "name":"GitHub Repo",
            "url":"https://github.com/doanja/Cloud-Finance"
         },
         {
            "name":"Demo",
            "url":"https://cloud-finance.herokuapp.com/"
         }
      ]
   }
]